using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TatehamaATS_v1.OnboardDevice
{
    internal class StopPassManager
    {
        private Dictionary<string, string> StaNameById = new Dictionary<string, string>()
        {{"TH76","館浜"},{"TH75","駒野"},{"TH74","河原崎"},{"TH73","海岸公園"},{"TH72","虹ケ浜"},{"TH71","津崎"},{"TH70","浜園"},{"TH69","羽衣橋"},{"TH68","新井川"},{"TH67","新野崎"},{"TH66","江ノ原"},{"TH66S","江ノ原信号場"},{"TH65","大道寺"},{"TH64","藤江"},{"TH63","水越"},{"TH62","高見沢"},{"TH61","日野森"},{"TH60","奥峯口"},{"TH59","西赤山"},{"TH58","赤山町"},{"TH57","三郷"},{"TH56","明神川"},{"TH55S","珠川信号場"},{"TH55","珠川温泉"},{"TH54","上吉沢"},{"TH53","下吉沢"},{"TH52","名田"},{"TH51","三石"},{"TH50","二木戸"},{"TH49","白石町"},{"TH48","東井"},{"TH47","桜坂"},{"TH46","新大路"},{"TH45","大路"},{"TH44","常盤通"},{"TH43","広小路"},{"TH42","田村"},{"TH41","二ツ山"},{"TH40","小沼"},{"TH39","六日市町"},{"TH38","朝日ヶ丘"},{"TH37","大野宮"},{"TH36","沢井"},{"TH35","箕田"},{"TH34","江西"},{"TH33","大和田町"},{"TH32","木之本"},{"TH31","新長野公園"},{"TH30","長野本町"},{"TH29","高砂町"},{"TH28","東福"},{"TH27","千里が丘"},{"TH26","矢木"},{"TH25","北美"},{"TH24","緑ヶ丘"},{"TH23","町沢"},{"TH22","大原"},{"TH21","本郷"},{"TH20","五十川"},{"TH19","出屋敷前"},{"TH18","佐川"},{"TH17","夕陽が丘"},{"TH16","五日市"},{"TH15","南五日市"},{"TH14","高井戸八幡"},{"TH13","南八幡"},{"TH12","学院前"},{"TH11","中道"},{"TH10","佐野"},{"TH09","小手川"},{"TH08","南吉岡"},{"TH07","宮の前"},{"TH06","神宮橋"},{"TH05","宮松町"},{"TH04","青木町"},{"TH03","新町"},{"TH02","三番街"},{"TH01","大手橋"},{"TH00","ダミー"},}
        ;

        private Dictionary<string, string> StaKanaById = new Dictionary<string, string>()
        {{"TH76","テハ"},{"TH75","コマ"},{"TH74","ワサ"},{"TH73","イカ"},{"TH72","ニハ"},{"TH71","ツサ"},{"TH70","ハソ"},{"TH69","ハモ"},{"TH68","ライ"},{"TH67","ノキ"},{"TH66","エラ"},{"TH66S","ラシ"},{"TH65","タイ"},{"TH64","フエ"},{"TH63","スコ"},{"TH62","タサ"},{"TH61","ヒモ"},{"TH60","ミツ"},{"TH59","ニア"},{"TH58","アマ"},{"TH57","サコ"},{"TH56","ミヨ"},{"TH55S","カシ"},{"TH55","タマ"},{"TH54","ヨシ"},{"TH53","シワ"},{"TH52","ナタ"},{"TH51","ツシ"},{"TH50","フキ"},{"TH49","シシ"},{"TH48","トイ"},{"TH47","サラ"},{"TH46","シオ"},{"TH45","オオ"},{"TH44","キリ"},{"TH43","ロシ"},{"TH42","タラ"},{"TH41","タヤ"},{"TH40","コヌ"},{"TH39","ムイ"},{"TH38","サオ"},{"TH37","オミ"},{"TH36","サイ"},{"TH35","ミタ"},{"TH34","エニ"},{"TH33","ホワ"},{"TH32","キモ"},{"TH31","シエ"},{"TH30","ナノ"},{"TH29","サチ"},{"TH28","トフ"},{"TH27","リカ"},{"TH26","ヤキ"},{"TH25","キミ"},{"TH24","リカ"},{"TH23","マワ"},{"TH22","オハ"},{"TH21","ホコ"},{"TH20","イソ"},{"TH19","テキ"},{"TH18","サカ"},{"TH17","ユイ"},{"TH16","イカ"},{"TH15","ミチ"},{"TH14","タハ"},{"TH13","ナワ"},{"TH12","カエ"},{"TH11","ナチ"},{"TH10","サノ"},{"TH09","コカ"},{"TH08","ミオ"},{"TH07","ミエ"},{"TH06","シン"},{"TH05","ヤツ"},{"TH04","アチ"},{"TH03","シチ"},{"TH02","ハイ"},{"TH01","オテ"},{"TH00",""},}
        ;

        private Dictionary<string, string> StopDataById = new Dictionary<string, string>()
        {{"TH76","停車"},{"TH75","停車"},{"TH74","停車"},{"TH73","停車"},{"TH72","停車"},{"TH71","停車"},{"TH70","停車"},{"TH69","停車"},{"TH68","停車"},{"TH67","停車"},{"TH66","停車"},{"TH66S","停車"},{"TH65","停車"},{"TH64","停車"},{"TH63","停車"},{"TH62","停車"},{"TH61","停車"},{"TH60","停車"},{"TH59","停車"},{"TH58","停車"},{"TH57","停車"},{"TH56","停車"},{"TH55S","停車"},{"TH55","停車"},{"TH54","停車"},{"TH53","停車"},{"TH52","停車"},{"TH51","停車"},{"TH50","停車"},{"TH49","停車"},{"TH48","停車"},{"TH47","停車"},{"TH46","停車"},{"TH45","停車"},{"TH44","停車"},{"TH43","停車"},{"TH42","停車"},{"TH41","停車"},{"TH40","停車"},{"TH39","停車"},{"TH38","停車"},{"TH37","停車"},{"TH36","停車"},{"TH35","停車"},{"TH34","停車"},{"TH33","停車"},{"TH32","停車"},{"TH31","停車"},{"TH30","停車"},{"TH29","停車"},{"TH28","停車"},{"TH27","停車"},{"TH26","停車"},{"TH25","停車"},{"TH24","停車"},{"TH23","停車"},{"TH22","停車"},{"TH21","停車"},{"TH20","停車"},{"TH19","停車"},{"TH18","停車"},{"TH17","停車"},{"TH16","停車"},{"TH15","停車"},{"TH14","停車"},{"TH13","停車"},{"TH12","停車"},{"TH11","停車"},{"TH10","停車"},{"TH09","停車"},{"TH08","停車"},{"TH07","停車"},{"TH06","停車"},{"TH05","停車"},{"TH04","停車"},{"TH03","停車"},{"TH02","停車"},{"TH01","停車"},{"TH00",""},};

        internal List<string> GetAllStationIds()
        {
            return StaNameById.Keys.ToList();
        }

        internal string GetStationNameById(string id)
        {
            if (StaNameById.TryGetValue(id, out string name))
            {
                return name;
            }
            return "不明駅";
        }

        internal string GetStationKanaById(string id)
        {
            if (StaKanaById.TryGetValue(id, out string name))
            {
                return name;
            }
            return "？？";
        }

        internal string GetStopDataById(string id)
        {
            if (StopDataById.TryGetValue(id, out string name))
            {
                return name;
            }
            return "？？";
        }

        internal void SetStopDataById(string id, string data)
        {
            if (StopDataById.ContainsKey(id))
            {
                StopDataById[id] = data;
            }
        }
    }
}
